Tekla Open API Reference for Tekla Structures 2025
ViewBase.GetObjects Method
 Gets the objects in the view. Does not return child objects (single dimensions, grid lines, views).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetObjects()
Public Function GetObjects As DrawingObjectEnumerator
Return Value
Type: DrawingObjectEnumerator
The objects in the view.
Implements
IHasChildren.GetObjects()
See Also
Reference
ViewBase Class
GetObjects Overload
Tekla.Structures.Drawing Namespace